/***************************************************************************
    Generic Image Processing (GIP) Framework
    A framework for developing image processing applications

    Copyright (C) 2002 by Rene Moeller Fonseca <fonseca@mip.sdu.dk>

    This framework is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.

    For the licensing terms refer to the file 'LICENSE'.
 ***************************************************************************/

#include <gip/video/Camera1394.h>
#include <base/UnexpectedFailure.h>
#include <base/mathematics/Math.h>
#include <base/string/StringOutputStream.h>
#include <base/Cast.h>

namespace gip {

  namespace Camera1394Impl {

    /** Specifies the maximum number of modes per format. */
    static const unsigned int MAXIMUM_MODES_PER_FORMAT = 32;
    
    struct ModeInformation {
      unsigned int format; // the specification format
      unsigned int mode; // the mode specification
      unsigned int width; // 0 is unspecified
      unsigned int height; // 0 is unspecified
      int pixelFormat; // -1 is unspecified
    };
    
    const ModeInformation MODE_INFORMATION[] = {
      {Camera1394::UNCOMPRESSED_VGA, 0, 160, 120, Camera1394::YUV_444_8BIT},
      {Camera1394::UNCOMPRESSED_VGA, 1, 320, 240, Camera1394::YUV_422_8BIT},
      {Camera1394::UNCOMPRESSED_VGA, 2, 640, 480, Camera1394::YUV_411_8BIT},
      {Camera1394::UNCOMPRESSED_VGA, 3, 640, 480, Camera1394::YUV_422_8BIT},
      {Camera1394::UNCOMPRESSED_VGA, 4, 640, 480, Camera1394::RGB_8BIT},
      {Camera1394::UNCOMPRESSED_VGA, 5, 640, 480, Camera1394::Y_8BIT},
      {Camera1394::UNCOMPRESSED_VGA, 6, 640, 480, Camera1394::Y_16BIT},
      
      {Camera1394::UNCOMPRESSED_SUPER_VGA_I, 0, 800, 600, Camera1394::YUV_422_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_I, 1, 800, 600, Camera1394::RGB_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_I, 2, 800, 600, Camera1394::Y_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_I, 3, 1024, 768, Camera1394::YUV_422_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_I, 4, 1024, 768, Camera1394::RGB_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_I, 5, 1024, 768, Camera1394::Y_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_I, 6, 800, 600, Camera1394::Y_16BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_I, 7, 1024, 768, Camera1394::Y_16BIT},
      
      {Camera1394::UNCOMPRESSED_SUPER_VGA_II, 0, 1280, 960, Camera1394::YUV_422_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_II, 1, 1280, 960, Camera1394::RGB_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_II, 2, 1280, 960, Camera1394::Y_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_II, 3, 1600, 1200, Camera1394::YUV_422_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_II, 4, 1600, 1200, Camera1394::RGB_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_II, 5, 1600, 1200, Camera1394::Y_8BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_II, 6, 1280, 960, Camera1394::Y_16BIT},
      {Camera1394::UNCOMPRESSED_SUPER_VGA_II, 7, 1600, 1200, Camera1394::Y_16BIT},
      
      {Camera1394::STILL_IMAGE, 0, 0, 0, -1},
      
      {Camera1394::PARTIAL_IMAGE, 0, 0, 0, -1},
      {Camera1394::PARTIAL_IMAGE, 1, 0, 0, -1},
      {Camera1394::PARTIAL_IMAGE, 2, 0, 0, -1},
      {Camera1394::PARTIAL_IMAGE, 3, 0, 0, -1},
      {Camera1394::PARTIAL_IMAGE, 4, 0, 0, -1},
      {Camera1394::PARTIAL_IMAGE, 5, 0, 0, -1},
      {Camera1394::PARTIAL_IMAGE, 6, 0, 0, -1},
      {Camera1394::PARTIAL_IMAGE, 7, 0, 0, -1}
    };
    
    enum Register {
      // camera initialization register
      INITIALIZE = 0x000,

      // inquiry register for video format
      V_FORMAT_INQ = 0x100,

      // inquiry register for video mode
      V_MODE_INQ_0 = 0x180,
      V_MODE_INQ_1 = 0x184,
      V_MODE_INQ_2 = 0x188,
      V_MODE_INQ_6 = 0x198,
      V_MODE_INQ_7 = 0x19c,

      // inquiry register for frame rate
      V_RATE_INQ_0_0 = 0x200,
      V_RATE_INQ_0_1 = 0x204,
      V_RATE_INQ_0_2 = 0x208,
      V_RATE_INQ_0_3 = 0x20c,
      V_RATE_INQ_0_4 = 0x210,
      V_RATE_INQ_0_5 = 0x214,
      V_RATE_INQ_0_6 = 0x218,
      
      V_RATE_INQ_1_0 = 0x220,
      V_RATE_INQ_1_1 = 0x224,
      V_RATE_INQ_1_2 = 0x228,
      V_RATE_INQ_1_3 = 0x22c,
      V_RATE_INQ_1_4 = 0x230,
      V_RATE_INQ_1_5 = 0x234,
      V_RATE_INQ_1_6 = 0x238,
      V_RATE_INQ_1_7 = 0x23c,
      
      V_RATE_INQ_2_0 = 0x240,
      V_RATE_INQ_2_1 = 0x244,
      V_RATE_INQ_2_2 = 0x248,
      V_RATE_INQ_2_3 = 0x24c,
      V_RATE_INQ_2_4 = 0x250,
      V_RATE_INQ_2_5 = 0x254,
      V_RATE_INQ_2_6 = 0x258,
      V_RATE_INQ_2_7 = 0x25c,
      
      V_REV_INQ_6_0 = 0x2c0,
      
      V_CSR_INQ_7_0 = 0x2e0,
      V_CSR_INQ_7_1 = 0x2e4,
      V_CSR_INQ_7_2 = 0x2e8,
      V_CSR_INQ_7_3 = 0x2ec,
      V_CSR_INQ_7_4 = 0x2f0,
      V_CSR_INQ_7_5 = 0x2f4,
      V_CSR_INQ_7_6 = 0x2f8,
      V_CSR_INQ_7_7 = 0x2fc,

      // inquiry registers for feature presence
      BASIC_FUNC_INQ = 0x400,
      FEATURE_HI_INQ = 0x404,
      FEATURE_LO_INQ = 0x408,
      ADVANCED_FEATURE_INQ = 0x480,

      // inquiry registers for features
      BRIGHTNESS_INQ = 0x500,
      AUTO_EXPOSURE_INQ = 0x504,
      SHARPNESS_INQ = 0x508,
      WHITE_BALANCE_INQ = 0x50c,
      HUE_INQ = 0x510,
      SATURATION_INQ = 0x514,
      GAMMA_INQ = 0x518,
      SHUTTER_INQ = 0x51c,
      GAIN_INQ = 0x520,
      IRIS_INQ = 0x524,
      FOCUS_INQ = 0x528,
      TEMPERATURE_INQ = 0x52c,
      TRIGGER_INQ = 0x530,
      ZOOM_INQ = 0x580,
      PAN_INQ = 0x584,
      TILT_INQ = 0x588,
      OPTICAL_FILTER_INQ = 0x58c,
      CAPTURE_SIZE_INQ = 0x5c0,
      CAPTURE_QUALITY_INQ = 0x5c4,

      // status and control registers for camera
      CURRENT_V_RATE = 0x600,
      CURRENT_V_MODE = 0x604,
      CURRENT_V_FORMAT = 0x608,
      ISO_CHANNEL = 0x60c,
      POWER = 0x610,
      ISO_ENABLE = 0x614,
      MEMORY_SAVE = 0x618,
      FINITE_SHOTS = 0x61c,
      MEMORY_SAVE_CHANNEL = 0x620,
      CURRENT_MEMORY_CHANNEL = 0x624,
      ERROR_STATUS = 0x628,

      // feature error status registers
      FEATURE_ERROR_STATUS_HIGH = 0x640,
      FEATURE_ERROR_STATUS_LOW = 0x644,

      // absolute value CSR offset registers
      ABSOLUTE_VALUE_CSR = 0x700,
      
      // status and control registers for features
      FEATURE_BRIGHTNESS = 0x800,
      FEATURE_AUTO_EXPOSURE = 0x804,
      FEATURE_SHARPNESS = 0x808,
      FEATURE_WHITE_BALANCE = 0x80c,
      FEATURE_HUE = 0x810,
      FEATURE_SATURATION = 0x814,
      FEATURE_GAMMA = 0x818,
      FEATURE_SHUTTER = 0x81c,
      FEATURE_GAIN = 0x820,
      FEATURE_IRIS = 0x824,
      FEATURE_FOCUS = 0x828,
      FEATURE_TEMPERATURE = 0x82c,
      FEATURE_TRIGGER = 0x830,
      FEATURE_ZOOM = 0x880,
      FEATURE_PAN = 0x884,
      FEATURE_TILT = 0x888,
      FEATURE_OPTICAL_FILTER = 0x88c,
      FEATURE_CAPTURE_SIZE = 0x8c0,
      FEATURE_CAPTURE_QUALITY = 0x8c4
    };

    enum Format7CSRRegister {
      MAX_IMAGE_SIZE_INQ = 0x000,
      UNIT_SIZE_INQ = 0x004,
      IMAGE_POSITION = 0x008,
      IMAGE_SIZE = 0x00c,
      COLOR_CODING_ID = 0x010,
      COLOR_CODING_INQ = 0x014,
      PIXEL_NUMBER_INQ = 0x034,
      TOTAL_BYTES_HI_INQ = 0x038,
      TOTAL_BYTES_LO_INQ = 0x03c,
      PACKET_PARA_INQ = 0x040,
      BYTE_PER_PACKET = 0x044,
      PACKET_PER_FRAME_INQ = 0x048,
      UNIT_POSITION_INQ = 0x04c, // 1.30 specification or later
      VALUE_SETTING = 0x07c // 1.30 specification or later
    };
    
    struct BusInfo {
      BigEndian<uint32> name; // "1394"
      BigEndian<uint32> flags;
      uint8 guid[8];
    } _DK_SDU_MIP__BASE__PACKED busInfo;
    
    struct RootDirectory {
      BigEndian<uint32> crc;
      BigEndian<uint32> vendorId; // 0x03 in MSB
      BigEndian<uint32> flags; // 0x0c in MSB
      BigEndian<uint32> nodeOffset; // 0x8d in MSB
      BigEndian<uint32> deviceDirectoryOffset; // 0xd1 in MSB
    } _DK_SDU_MIP__BASE__PACKED rootDirectory;
    
    struct DeviceIndependentDirectory {
      BigEndian<uint32> crc;
      BigEndian<uint32> specification; // 0x12 in MSB
      BigEndian<uint32> version; // 0x13 in MSB
      BigEndian<uint32> dependentOffset; // 0xd4 in MSB
    } _DK_SDU_MIP__BASE__PACKED;
    
    struct DeviceDependentDirectory {
      BigEndian<uint16> size;
      BigEndian<uint16> crc;
      BigEndian<uint32> commandRegisters; // 0x40 in MSB
      BigEndian<uint32> vendorNameLeaf; // 0x81 in MSB
      BigEndian<uint32> modelNameLeaf; // 0x82 in MSB
    } _DK_SDU_MIP__BASE__PACKED;
    
    struct ConfigurationIntro {
      BigEndian<uint32> crc;
      BusInfo busInfo;
      RootDirectory rootDirectory;
    } _DK_SDU_MIP__BASE__PACKED;
    
    struct FeatureInquery {
      unsigned int maximumValue : 12;
      unsigned int minimumValue : 12;
      bool manualMode : 1;
      bool autoMode : 1;
      bool switchable : 1;
      bool readable : 1;
      bool onePush : 1;
      bool reserved : 1;
      bool absoluteControl : 1;
      bool presence : 1;
    } _DK_SDU_MIP__BASE__PACKED;
    
    struct TriggerFeatureInquery {
      unsigned int reserved2 : 12;
      bool mode3 : 1;
      bool mode2 : 1;
      bool mode1 : 1;
      bool mode0 : 1;
      unsigned int reserved1 : 9;
      bool polarity : 1;
      bool switchable : 1;
      bool readable : 1;
      unsigned int reserved0 : 2;
      bool absoluteControl : 1;
      bool presence : 1;
    } _DK_SDU_MIP__BASE__PACKED;

